docs/package dmp/DMP_LPS_Exemple de messages_1.0.1_1 - v02.05.00/TD0.2 - Test d'existence_r‚ponse.xml

<soap:Envelope xmlns:ns1="urn:si-dmp-patients" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header>
		<Action xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201308UV02</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:52c2786e-cb61-48cc-a621-24113888b3e6</MessageID>
		<To xmlns="http://www.w3.org/2005/08/addressing">http://www.w3.org/2005/08/addressing/anonymous</To>
		<RelatesTo xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:0b6f4648-f2e9-4a06-94fd-c563a807212f</RelatesTo>
	</soap:Header>
	<soap:Body>
		<PRPA_IN201308UV02 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3" xmlns:ns2="asip:ci-sis:gdp:2010">
			<id root="0cc7f660-e7b5-4131-aee3-5ad75c0b32f2"/>
			<creationTime value="20210601125305"/>
			<interactionId extension="PRPA_IN201308UV02" root="2.16.840.1.113883.1.6"/>
			<processingCode code="P"/>
			<processingModeCode code="T"/>
			<acceptAckCode code="NE"/>
			<receiver typeCode="RCV">
				<device classCode="DEV" determinerCode="INSTANCE">
					<id root="1.3.6.1.4.1.48364"/>
					<softwareName>LPS GIE-SV</softwareName>
				</device>
			</receiver>
			<sender typeCode="SND">
				<device classCode="DEV" determinerCode="INSTANCE">
					<id root="1.2.250.1.213.4.1.1.1"/>
					<softwareName>DMP</softwareName>
				</device>
			</sender>
			<attentionLine>
				<keyWordText code="AUTORISATION" codeSystem="1.2.250.1.213.4.1.2.6.1"/>
				<value code="VALIDE" codeSystem="1.2.250.1.213.4.1.2.6.2" xsi:type="CV" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
			</attentionLine>
			<attentionLine>
				<keyWordText code="STATUT_MT" codeSystem="1.2.250.1.213.4.1.2.6.3"/>
				<value value="true" xsi:type="BL" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
			</attentionLine>
			<acknowledgement typeCode="AA">
				<targetMessage>
					<id extension="1633a409-3d61-4869-aed8-74d92ae20272" root="1.3.6.1.4.1.48364.1.1"/>
				</targetMessage>
			</acknowledgement>
			<controlActProcess classCode="CACT" moodCode="EVN">
				<reasonCode code="TEST_EXST" codeSystem="1.2.250.1.213.1.1.4.11" displayName="Test d'existence de dossier"/>
				<subject contextConductionInd="false" typeCode="SUBJ">
					<registrationEvent classCode="REG" moodCode="EVN">
						<statusCode code="completed"/>
						<subject1 typeCode="SBJ">
							<patient classCode="PAT">
								<id extension="1197854176879056415520" root="1.2.250.1.213.1.4.2"/>
								<id extension="207058575627097" root="1.2.250.1.213.1.4.10"/>
								<statusCode code="active"/>
								<patientPerson classCode="PSN" determinerCode="INSTANCE">
									<name>
										<prefix>M</prefix>
										<given>LAURENCE</given>
										<family qualifier="SP">patb-quatre</family>
									</name>
									<telecom value="mailto:alain@gmail.com"/>
									<telecom use="MC" value="tel:0102030405"/>
									<administrativeGenderCode code="M"/>
									<birthTime value="19070525"/>
								</patientPerson>
								<subjectOf typeCode="SBJ">
									<administrativeObservation classCode="OBS" moodCode="EVN">
										<code code="COMPTE_INTERNET_OUVERT" codeSystem="1.2.250.1.213.4.1.2.9"/>
										<value value="true" xsi:type="BL" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
									</administrativeObservation>
								</subjectOf>
								<subjectOf typeCode="SBJ">
									<administrativeObservation classCode="OBS" moodCode="EVN">
										<code code="RATTACHEMENT_ENS" codeSystem="1.2.250.1.213.4.1.2.3" displayName="information de rattachement du DMP à un ENS"/>
										<value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" value="false" xsi:type="BL"/>
									</administrativeObservation>
								</subjectOf>
							</patient>
						</subject1>
						<custodian typeCode="CST">
							<assignedEntity classCode="ASSIGNED">
								<id root="1.2.250.1.213.4.1.1.1"/>
							</assignedEntity>
						</custodian>
					</registrationEvent>
				</subject>
				<queryAck>
					<queryId extension="87d5fd8f-72b2-43bf-938c-0402bf850d25" root="1.3.6.1.4.1.48364.2"/>
					<queryResponseCode code="OK"/>
				</queryAck>
			</controlActProcess>
		</PRPA_IN201308UV02>
	</soap:Body>
</soap:Envelope>