docs/package dmp/DMP_LPS_Exemple de messages_1.0.1_1 - v02.05.00/TD1.3a - Consultation_r‚ponse.xml

<soap:Envelope xmlns:ns1="urn:si-dmp-patients" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Header>
      <Action xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201308UV02</Action>
      <MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:de08bf41-0df2-4e8f-ba3c-e4ce69d842ac</MessageID>
      <To xmlns="http://www.w3.org/2005/08/addressing">http://www.w3.org/2005/08/addressing/anonymous</To>
      <RelatesTo xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:96206ddb-e088-4e38-b764-df9339f407f1</RelatesTo>
   </soap:Header>
   <soap:Body>
      <PRPA_IN201308UV02 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3" xmlns:ns2="asip:ci-sis:gdp:2010">
         <id root="f3d4e7ef-d83a-4462-b827-3e48993b6d1d"/>
         <creationTime value="20210601132959"/>
         <interactionId extension="PRPA_IN201308UV02" root="2.16.840.1.113883.1.6"/>
         <processingCode code="P"/>
         <processingModeCode code="T"/>
         <acceptAckCode code="NE"/>
         <receiver typeCode="RCV">
            <device classCode="DEV" determinerCode="INSTANCE">
               <id root="1.3.6.1.4.1.48364"/>
               <softwareName>LPS GIE-SV</softwareName>
            </device>
         </receiver>
         <sender typeCode="SND">
            <device classCode="DEV" determinerCode="INSTANCE">
               <id root="1.2.250.1.213.4.1.1.1"/>
               <softwareName>DMP</softwareName>
            </device>
         </sender>
         <acknowledgement typeCode="AA">
            <targetMessage>
               <id extension="1633a409-3d61-4869-aed8-74d92ae20272" root="1.3.6.1.4.1.48364.1.1"/>
            </targetMessage>
         </acknowledgement>
         <controlActProcess classCode="CACT" moodCode="EVN">
            <reasonCode code="CNSLT_DATA" codeSystem="1.2.250.1.213.1.1.4.11" displayName="Consultation des données de gestion de dossier"/>
            <subject contextConductionInd="false" typeCode="SUBJ">
               <registrationEvent classCode="REG" moodCode="EVN">
                  <statusCode code="completed"/>
                  <subject1 typeCode="SBJ">
                     <patient classCode="PAT">
                        <id extension="1197854176879056415520" root="1.2.250.1.213.1.4.2"/>
                        <id extension="207058575627097" root="1.2.250.1.213.1.4.10"/>
                        <statusCode code="active"/>
                        <patientPerson classCode="PSN" determinerCode="INSTANCE">
                           <name>
                              <prefix>M</prefix>
                              <given>LAURENCE</given>
                              <family qualifier="SP">patb-quatre</family>
                           </name>
                           <telecom value="mailto:alain@gmail.com"/>
                           <telecom use="MC" value="tel:0102030405"/>
                           <telecom use="MC" value="tel:0102030405"/>
                           <telecom value="mailto:alain@gmail.com"/>
                           <administrativeGenderCode code="M"/>
                           <birthTime value="19070525"/>
                           <deceasedInd value="false"/>
                           <addr>
                              <streetAddressLine>1, rue du Chat qui pêche</streetAddressLine>
                              <postalCode>75005</postalCode>
                              <city>Paris</city>
                           </addr>
                           <personalRelationship classCode="PRS">
                              <code code="FTH" codeSystem="2.16.840.1.113883.1.11.19579"/>
                              <addr>
                                 <streetAddressLine>3 rue d Amsterdam</streetAddressLine>
                                 <additionalLocator>Residence du Parc</additionalLocator>
                                 <postalCode>59000</postalCode>
                                 <city>LILLE</city>
                              </addr>
                              <telecom use="HP" value="tel:0923456789"/>
                              <telecom use="MC" value="tel:0601020304"/>
                              <telecom value="mailto:replegl@foogentle.com"/>
                              <relationshipHolder1 classCode="PSN" determinerCode="INSTANCE">
                                 <name>
                                    <prefix>M</prefix>
                                    <given>Jean</given>
                                    <family>REPLEG</family>
                                 </name>
                              </relationshipHolder1>
                           </personalRelationship>
                           <birthPlace classCode="BIRTHPL">
                              <addr/>
                           </birthPlace>
                        </patientPerson>
                        <subjectOf typeCode="SBJ">
                           <administrativeObservation classCode="OBS" moodCode="EVN">
                              <code code="OPPOSITION_BRIS_DE_GLACE" codeSystem="1.2.250.1.213.4.1.2.3" displayName="opposition au mode bris de glace"/>
                              <value value="false" xsi:type="BL" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                           </administrativeObservation>
                        </subjectOf>
                        <subjectOf typeCode="SBJ">
                           <administrativeObservation classCode="OBS" moodCode="EVN">
                              <code code="OPPOSITION_ACCES_URGENCE" codeSystem="1.2.250.1.213.4.1.2.3" displayName="opposition à l'accès au mode urgence"/>
                              <value value="false" xsi:type="BL" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                           </administrativeObservation>
                        </subjectOf>
                     </patient>
                  </subject1>
                  <custodian typeCode="CST">
                     <assignedEntity classCode="ASSIGNED">
                        <id root="1.2.250.1.213.4.1.1.1"/>
                     </assignedEntity>
                  </custodian>
               </registrationEvent>
            </subject>
            <queryAck>
               <queryId extension="87d5fd8f-72b2-43bf-938c-0402bf850d25" root="1.3.6.1.4.1.48364.2"/>
               <queryResponseCode code="OK"/>
            </queryAck>
         </controlActProcess>
      </PRPA_IN201308UV02>
   </soap:Body>
</soap:Envelope>